import React, {useEffect, useRef} from 'react';
import Header from "./header/header.component";
import Footer from "./footer/footer.component";
import {Link} from "react-router-dom";
import {FontAwesomeIcon} from "@fortawesome/react-fontawesome";
import {faArrowLeft} from "@fortawesome/free-solid-svg-icons";

const Terms = () => {
	const container = useRef(null);

	useEffect(() => {
		if (container?.current) {
			container.current.scrollIntoView({ behavior: 'smooth' });
		}
	}, []);

	return (
		<div className="homeMainContainer">
			<Header />
			<div ref={container}></div>
			<div className="container d-flex justify-content-start align-items-start flex-column mt-5 main text-justify">
				<h4 className="fontSizeBig font-weight-bold">قوانین و مقررات مجیک آف</h4>
				<p className="mt-4">مشتری گرامی لطفا قبل از خرید و استفاده از خدمات وب سایت موارد زیر را به دقت مطالعه نمایید.</p>
				<p>ورود مشتریان به وب سایت و عضویت با اطلاعات شخصی، خرید و استفاده از خدمات ارائه شده در وب سایت به معنای آگاهی کامل و پذیرفتن قوانین و شرایط استفاده از وب سایت وخدمات تخفیف محموعه ی اینترنتی مجیک آف خواهد بود و مشتری با عضویت و ثبت نام  قبول کلیه شرایط و قوانین وب سایت را اعلام نموده است. قوانین و شرایط مندرج در سایت همواره جایگزین کلیه توافق های قبلی خواهد بود.</p>
				<label className="mt-5 fontSizeMiddle font-weight-bold">قوانین عمومی</label>
				<p className="mt-1 fontSizeMiddle">
					توجه داشته باشید کلیه اصول و رویه‏‌های سایت و مجموعه ی  اینترنتی مجیک آف  منطبق با قوانین جمهوری اسلامی ایران، قانون تجارت الکترونیک و قانون حمایت از حقوق مصرف کننده است و متعاقباً کاربر نیز موظف به رعایت قوانین مرتبط با کاربر است. در صورتی که در قوانین مندرج، رویه‏‌ها و سرویس‏‌های مجموعه مجیک آف  تغییراتی در آینده ایجاد شود، در همین صفحه منتشر و به روز رسانی می شود.
				</p>
				<label className="mt-5 fontSizeMiddle font-weight-bold">سیاست‏های رعایت حریم شخصی</label>
				<p className="mt-1 fontSizeMiddle">
					مجیک آف  به اطلاعات خصوصی اشخاصى که از خدمات سایت استفاده می‏‌کنند، احترام گذاشته و از آن محافظت می‏‌کند.
				</p>
				<p className="mt-1 fontSizeMiddle">
					مجیک آف  متعهد می‏‌شود در حد توان از حریم شخصی شما محافظت کند و با استفاده از تکنولوژی های امنیتی روز از اطلاعات شخصی شما در مبحث خرید اینترنتی صیانت کند. در حقیقت با خرید ازسایت  مجیک آف رضایت خود را از این سیاست نشان می‏‌دهید.
				</p>
				<p className="mt-1 fontSizeMiddle">
					تنها مرجع رسمی مورد تایید ما برای ارتباط با شما، پایگاه رسمی این سایت یعنی www.magicoff.ir است. ما با هیچ روش دیگری جز ارسال پیام از طریق آدرس‏‌های رسمی و تایید شده در سایت، با شما تماس نمی‌‏گیریم. وب سایت مجیک آف هیچ گونه سایت اینترنتی با آدرسی غیر از www.magicoff.ir و همچنین، هیچ گونه وبلاگ و شناسه در برنامه‏‌های گفتگوی اینترنتی همچون Yahoo Messenger یا MSN Messenger وغیره ندارد و هیچ ‏گاه با این روش‏‌ها با شما تماس نمی‏‌گیرد. کاربران جهت برقراری ارتباط، تنها می‏‌توانند از آدرس‌‏های ذکر شده در بخش ارتباط با ما استفاده کنند.
				</p>
				<p className="mt-1 fontSizeMiddle">
					در صورت بروز هرگونه خطا نسبت به درج قیمت و ارزش ریالی خدمات موجود در سایت، حق بلا اثر نمودن سفارش و خرید انجام شده توسط مشتری، برای مجیک آف   محفوظ است. سایت مجیک آف در اسرع وقت وجوه دریافتی را طی 24 الی 48 ساعت کاری به حساب اعلام شده توسط مشتری واریز و عودت می‌نماید و مشتری با ورود به سایت می‌پذیرد از این امر آگاهی داشته و در این خصوص ادعایی نخواهد داشت.
				</p>
				<p className="mt-1 fontSizeMiddle">
					کاربران باید هنگام سفارش خدمات مورد نظر خود، فرم سفارش را با اطلاعات صحیح و به طور کامل تکمیل کنند. بدیهی است درصورت ورود اطلاعات ناقص یا نادرست، اشتراک کاربر قابل  تحویل نخواهد بود. بنابراین درج اطلاعات شناسایی و شماره تماس همراه توسط مشتری، به منزله مورد تایید بودن صحت آنها است و در صورتی که این موارد به صورت صحیح یا کامل درج نشده باشد، سایت مجیک آف جهت اطمینان از صحت و قطعیت ثبت سفارش می‌تواند از مشتری، اطلاعات تکمیلی  درخواست کند. همچنین مشتریان نمی‌توانند نام،  و اطلاعات شخص دیگری را برای تحویل  اشتراک وارد کنند.
				</p>
				<p className="mt-1 fontSizeMiddle">
					لازم به ذکر است که این امر به منظور جلوگیری از سواستفاده‌های احتمالی و مواردی نظیر جلوگیری از خرید با اشتراک های تقلبی  و موارد مشابه در نظر گرفته شده است.
				</p>
				<label className="mt-5 fontSizeMiddle font-weight-bold">محتوا</label>
				<p className="mt-1 fontSizeMiddle">
					سایت و مجموعه ی  مجیک آف نهایت تلاش و دقت را در راستای ارائه تمامی خدمات خواهد کرد.
				</p>
				<p className="mt-1 fontSizeMiddle">
					سایت مجیک آف هیچ گونه مسئولیتی را در رابطه با حذف شدن صفحه‏‌های سایت خود و یا لینک‏‌های مرده نمی‌‏پذیرد. سروﻳس‌‏های سایت آن‏گونه که هست ارائه می‏‌شود و سایت  تحت هیچ شرایطی مسئولیت تاخیر یا عدم کارکرد سایت را که می‌تواند ناشى از عوامل طبیعى، نیروى انسانی، مشکلات اینترنتى، خرابی تجهیزات کامپیوترى، مخابراتى و غیره باشد بر عهده ندارد.
				</p>
				<p className="mt-1 fontSizeMiddle">
					© کلیه محتویات سایت مجیک آف شامل قانون حق تکثیر شده و به سایت  و مجموعه ی  اینترنتی  مجیک آف  تعلق دارد.
				</p>
				<label className="mt-5 fontSizeMiddle font-weight-bold">حریم خصوصی</label>
				<p className="mt-1 fontSizeMiddle">
					مجیک آف با تاکید بر احترامی که برای حریم شخصی مشتریان عزیز قائل است، برای خرید، ثبت نظر یا استفاده از برخی امکانات وب‌سایت اطلاعاتی را از مشتریان درخواست می‌کند تا بتواند خدماتی امن و مطمئن را به شما ارائه دهد. برای ثبت اشتراک، اطلاعاتی مانند نام و نام خانوادگی ، تاریخ تولد ، عکس سلفی کاربر مورد نیاز است و از آنجا که کلیه فعالیت‌های مجیک آف قانونی و مبتنی بر قوانین تجارت الکترونیک صورت می‌گیرد از این رو وارد کردن اطلاعاتی مانند نام و نام خانوادگی برای اشخاص حقیقی لازم است. یادآوری می‌شود  تلفن‌ تماسی که مشتری در پروفایل خود ثبت می‌کند، تنها تلفن‌  رسمی و مورد تایید مشتری است و تمام مکاتبات و پاسخ‌های شرکت از طریق آنها صورت می‌گیرد.
					بنابراین درج اطلاعات شناساییو  شماره تماس‌ همراه  توسط مشتری، به منزله مورد تایید بودن صحت آنها است و در صورتی که موارد فوق به صورت صحیح یا کامل درج نشده باشد، مجیک آف جهت اطمینان از صحت و قطعیت ثبت اشتراک می‌تواند از مشتری اطلاعات تکمیلی و صحیح را درخواست کند.
				</p>
				<p className="mt-1 fontSizeMiddle">
					مشتریان نمی‌توانند اطلاعات شناسایی شخص دیگری را برای ثبت اشتراک وارد کنند.
				</p>
				<p className="mt-1 fontSizeMiddle">
					همچنین مجموعه ی اینترنتی مجیک آف ممکن است برای ارتباط با مشتریان، بهینه‌سازی محتوای وب‌سایت و تحقیقات بازاریابی از برخی اطلاعات استفاده کند و برای اطلاع‌رسانی رویدادها، اخبار، خدمات و سرویس‌های ویژه یا پروموشن‌ها، برای اعضای وب‌سایت   پیامک ارسال نماید.
				</p>
				<p className="mt-1 fontSizeMiddle">
					مجیک آف ممکن است نقد و نظرهای ارسالی مشتریان عزیز را در راستای رعایت قوانین وب سایت ویرایش کند. همچنین اگر نظر یا پیام ارسال شده توسط کاربر، مشمول مصادیق محتوای مجرمانه باشد، مجیک آف می‌تواند از اطلاعات ثبت‌شده برای پیگیری قانونی استفاده کند. مشتریان عزیز ضمن استفاده از خدمات وب‌سایت مجیک آف ، حق ویرایش اطلاعات و استفاده از آنها را در چارچوب فوق‌الذکر به مجیک آف اعطا نموده و حق اعتراض را از خود سلب می‌نمایند.
				</p>
				<p className="mt-1 fontSizeMiddle">
					باید تاکید شود که حفظ و نگهداری رمز عبور و نام کاربری بر عهده مشتریان عزیز است و لذا برای جلوگیری از هرگونه سواستفاده احتمالی، مشتریان عزیز نباید آن اطلاعات را برای شخص دیگری فاش کنند. در صورتی که کاربر شماره همراه خود را به فردی دیگر واگذار کرد، جهت جلوگیری از سواستفاده یا مشکلات احتمالی مشتریان عزیز باید شماره موبایل خود را در پروفایل تغییر داده و شماره جدیدی ثبت نمایند.
				</p>
				<p className="mt-1 fontSizeMiddle">
					مسئولیت هرگونه خسارت احتمالی که ناشی از عدم رعایت موارد فوق‌الذکر توسط کاربر باشد، با خود کاربر بوده و کاربر حق هر گونه ادعا علیه مجیک آف را از خود سلب می‌کند. مجموعه ی  اینترنتی مجیک آف هویت شخصی مشتریان عزیز را محرمانه می‌داند و اطلاعات شخصی آنان را به هیچ شخص یا سازمان دیگری منتقل نمی‌کند، مگر اینکه با حکم مقام قضایی یا اداری صالحه یا طبق قوانین و مقررات رایج کشور موظف باشد در اختیار مراجع ذی‌صلاح قرار دهد. در این موارد هیچ گونه مسئولیت قانونی مبنی بر جبران خسارت برای مجیک آف وجود ندارد و مشتریان عزیز با اعلام رضایت خود در استفاده از خدمات وب سایت ضمنا حق هرگونه اعتراض را از خود سلب نموده اند.
				</p>
				<p className="mt-1 fontSizeMiddle">
					همچنین بدین وسیله به اطلاع مشتریان عزیز رسانده می‌شود که مجیک آق همانند سایر وب‌سایت‌ها از جمع‌آوری IP و کوکی‌ها استفاده می‌کند. پروتکل، سرور، لایه‌های امنیتی مجیک آف و روش‌های مناسب مدیریت داده‌ها حداکثر تلاش را به عمل می‌آورد که اطلاعات مشتریان عزیز را حفظ و از دسترسی‌های غیرقانونی جلوگیری کند. طبیعتا مسئولیت هرگونه سواستفاده به شخص یا اشخاص متخلف مربوط بوده و مجیک آف حق اعتراض و پیگیری را از طریق قانونی بنابر صلاح دید خود محفوظ می‌دارد.
				</p>
				<p className="mt-1 fontSizeMiddle">
					مجموعه ی اینترنتی مجیک آف برای حفاظت و نگهداری اطلاعات و حریم شخصی مشتریان عزیز همه توان خود را به کار می‌گیرد و امیدوار است که تجربه خریدی امن، راحت و خوشایند را برای همه مشتریان عزیز فراهم آورد.
				</p>
			</div>
			<div className="container-fluid fifthPart position-relative cpt-5 pb-3">
				<div className="container position-relative d-flex flex-column flex-md-row align-items-center justify-content-between mt-5 bgImage br10 shadow3">
					<div className="rightPart textShadowLight">
						{/*<p className="text-white fs24 font-weight-bold text-center">*/}
						{/*  جذاب‌ترین <span className="textSecondary fs40 font-weight-bold mr-1">تخفیف‌ها</span>*/}
						{/*</p>*/}
						<p className="text-white mb-1 fs30 text-center text-md-right clh26">برای دریافت اشتراک <span className="textSecondary fs30 font-weight-bold">کلیک </span>کنید.</p>
					</div>
					<Link to="/login" className="signUpLink centered textMain">
						<p className="noBreak m-0">ثبت نام</p>
						<span className="p-2 bgMain rounded-circle d-flex centered mr-4">
              <FontAwesomeIcon icon={faArrowLeft} color="white" className="fs16"/>
            </span>
					</Link>
				</div>
			</div>
			<Footer />
		</div>
	);
}

export default Terms;
