import React from 'react';

const Terms = () => {
	return (
		<div className="container d-flex justify-content-start align-items-start flex-column mt-5">
			<span className="fontSizeBig font-weight-bold">قوانین و مقررات ایزی سازه</span>
			<label className="mt-5 fontSizeMiddle font-weight-bold">قوانین عمومی</label>
			<p className="mt-1 fontSizeMiddle">
				تمامی اصول اساسی حاکم بر فعالیت ایزی سازه منطبق با قوانین جمهوری اسلامی ایران، قانون تجارت الکترونیک و قانون حمایت از حقوق مصرف‌کنند‌گان است و هر دو طرف (ایزی سازه و کاربران یا همان مشتریان) نسبت به انجام تکالیف خود بر اساس قوانین جاری کشور متعهد هستند. تمامی فعالیت‌های این سایت تابع قوانین و مقررات جمهوری اسلامی ایران است. همچنین در صورتی که در قوانین مندرج، رویه‏‌ها و سرویس‏‌های ایزی سازه تغییراتی در آینده ایجاد شود، در همین صفحه منتشر و به روز رسانی می شود و شما توافق می‏‌کنید که استفاده مستمر شما از این سایت به معنی پذیرش هرگونه تغییر است.
			</p>
			<label className="mt-5 fontSizeMiddle font-weight-bold">تعریف مشتری یا کاربر</label>
			<p className="mt-1 fontSizeMiddle">
				مشتری یا کاربر به شخصی گفته می‌شود که با اطلاعات کاربری خود که در فرم ثبت نام درج کرده است، به استفاده از خدمات ایزی سازه اقدام کند.
			</p>
			<label className="mt-5 fontSizeMiddle font-weight-bold">	ارتباطات الکترونیکی</label>
			<p className="mt-1 fontSizeMiddle">
				هنگامی که شما از سرویس‌‏ها و خدمات ایزی سازه استفاده می‏‌کنید، سفارش اینترنتی خود را ثبت یا خرید می‏‌کنید و یا به ایزی سازه ایمیل می‏‌زنید، این ارتباطات به صورت الکترونیکی انجام می‏‌شود و در صورتی که درخواست شما با رعایت کلیه اصول و رویه‏‌ها باشد، شما موافقت می‌‏کنید که ایزی سازه به صورت الکترونیکی (از طریق پست الکترونیکی و سایر سرویس‌های الکترونیکی) به درخواست شما پاسخ دهد.
			</p>
			<p className="mt-1 fontSizeMiddle">
				همچنین آدرس ایمیل و تلفن‌هایی که مشتری در پروفایل خود ثبت می‌کند، تنها آدرس ایمیل و تلفن‌های رسمی و مورد تایید مشتری است و تمام مکاتبات و پاسخ‌های شرکت از طریق آنها صورت می‌گیرد.
			</p>
			<p className="mt-1 fontSizeMiddle">
				توجه داشته باشید که سرویس ارسال پیامک (اس ام اس) برای ایزی سازه در حال حاضر فعال نیست و در صورت فعال شدن از طریق همین صفحه اعلام می شود. بنابراین ارسال هرگونه پیامک تحت عنوان ایزی سازه ، با هر شماره دیگری تخلف و سوء استفاده از نام ایزی سازه است و در صورت دریافت چنین پیامکی، لطفاً جهت پیگیری قانونی آن را به ایزی سازه اطلاع دهید.
			</p>
			<label className="mt-5 fontSizeMiddle font-weight-bold">سیاست‏‌های رعایت حریم شخصی</label>
			<p className="mt-1 fontSizeMiddle">
				ایزی سازه به اطلاعات خصوصی اشخاصى که از خدمات سایت استفاده می‏‌کنند، احترام گذاشته و از آن محافظت می‏‌کند.
				ایزی سازه متعهد می‏‌شود در حد توان از حریم شخصی شما دفاع کند و در این راستا، تکنولوژی مورد نیاز برای هرچه مطمئن‏‌تر و امن‏‌تر شدن استفاده شما از سایت را، توسعه دهد. در واقع با استفاده از سایت ایزی سازه ، شما رضایت خود را از این سیاست نشان می‏‌دهید.
			</p>
			<p className="mt-1 fontSizeMiddle">
				همه مطالب در دسترس از طریق هر یک از خدمات ایزی سازه ، مانند متن، گرافیک، آرم، آیکون ایزی سازه ، تصاویر، ویدئوهای تصویری، موارد قابل دانلود و کپی، داده‌ها و کلیه محتوای تولید شده توسط ایزی سازه جزئی از اموال ایزی سازه محسوب می‏‌شود و حق استفاده و نشر تمامی مطالب موجود و در دسترس در انحصار ایزی سازه است و هرگونه استفاده بدون کسب مجوز کتبی، حق پیگرد قانونی را برای ایزی سازه محفوظ می‏‌دارد. علاوه بر این، اسکریپت‌ها، و اسامی خدمات قابل ارائه از طریق هر یک از خدمات ایجاد شده توسط ایزی سازه و علائم تجاری ثبت شده نیز در انحصار ایزی سازه است و هر گونه استفاده با مقاصد تجاری پیگرد قانونی دارد. کاربران مجاز به بهره‌‏برداری و استفاده از لیست محصولات، مشخصات فنی، قیمت و هر گونه استفاده از مشتقات وب‏‌سایت ایزی سازه و یا هر یک از خدمات و یا مطالب، دانلود یا کپی کردن اطلاعات با مقاصد تجاری، هر گونه استفاده از داده کاوی، روبات، یا روش‌‏های مشابه مانند جمع آوری داده‌‏ها و ابزارهای استخراج نیستند و کلیه این حقوق به صراحت برای ایزی سازه محفوظ است. در صورت استفاده از هر یک از خدمات ایزی سازه ، کاربران مسئول حفظ محرمانه بودن حساب و رمز عبور خود هستند و تمامی مسئولیت فعالیت‌‏هایی که تحت حساب کاربری و یا رمز ورود انجام می‏‌پذیرد به عهده کاربران است.
			</p>
			<p className="mt-1 fontSizeMiddle">
				تنها مرجع رسمی مورد تایید ما برای ارتباط با شما، پایگاه رسمی این سایت یعنی https://ezsaze.ir است.
			</p>
			<p className="mt-1 fontSizeMiddle">
				ما با هیچ روش دیگری جز ارسال نامه از طرف آدرس‏‌های رسمی و تایید شده در سایت، با شما تماس نمی‌‏گیریم. وب سایت ایزی سازه هیچگونه سایت اینترنتی با آدرسی غیر از https://ezsaze.ir و همچنین، هیچ گونه وبلاگ و شناسه در برنامه‏‌های گفتگوی اینترنتی همچون Yahoo Messenger یا MSN Messenger و غیره ندارد و هیچ ‏گاه با این روش‏‌ها با شما تماس نمی‏‌گیرد. کاربران جهت برقراری ارتباط، تنها می‏‌توانند از آدرس‌‏های ذکر شده در بخش تماس با ما استفاده کنند.
			</p>
			<label className="mt-5 fontSizeMiddle font-weight-bold">نقدها، نظرها، ارتباطات و سایر مطالب</label>
			<p className="mt-1 fontSizeMiddle">
				سایت ایزی سازه ممکن است دارای لینک‏‌هایی به سایت‌های دیگر باشد. این سایت‏‌ها تحت کنترل ایزی سازه نیستند و سایت ایزی سازه هیچ مسوولیتی در قبال محتویات این سایت‏‌ها شامل (و نه محدود به) لینک‏‌های دیگری که ممکن است در این سایت‏‌ها باشد ندارد. سایت ایزی سازه این لینک‏‌ها را برای سهولت شما فراهم کرده است و وجود هر یک از این لینک‏‌ها به معنی تائید یا هر نوع ارتباط ما با اداره کنندگان آنها نیست. سایت‏‌هایى که در آگهی‏‌ها یا صفحه‏‌های سایت ایزی سازه لینک می‏‌شوند را افرادی خارج از ایزی سازه اداره می‌کنند، بنابراین سایت ایزی سازه نمی‌‏تواند در مورد آنها ضمانتى داشته باشد. شما توافق می‏‌کنید مسوولیت هر گونه خسارت و آسیب احتمالی وارده را از طرﻳﻖ وﻳﺮوس یا فایل‏‌های مخرب دیگر که می‌تواند ناشی از درﻳﺎفت و استفاده از داده‌‏ها و فایل‏‌های متعلق به سایت‏‌های لینک شده در سایت ایزی سازه باشد، خود برعهده خواهید داشت.
			</p>
			<p className="mt-1 fontSizeMiddle">
				*کاربرانی که قصد ارسال نظر و پرسش و پاسخ در سایت را دارند، حتما قوانین زیر را مد نظر داشته باشند:
			</p>
			<p className="mt-1 fontSizeMiddle">
				۱- بدیهی است که اگر این قوانین در نظرات کاربری رعایت نشود، نظر وی تایید نخواهد شد و در نتیجه در سایت به نمایش در نخواهد آمد.
				با این حال، ایزی سازه هیچگونه مسئولیتی در قبال صحت یا عدم صحت نظرات منتشر شده در این قسمت را ندارد. نمایش نظرات کاربران در سایت به هیچ وجه به معنی تایید فنی ایزی سازه درباره محتویات نظر نیست. لذا از کاربران محترم تقاضا می‌شود، نظرات را اصل و پایه انتخاب و تصمیم گیری خود قرار ندهند.
			</p>
			<p className="mt-1 fontSizeMiddle">
				۲- نقد کاربران باید شامل نقاط قوت و ضعف محصول در استفاده عملی و تجربه شخصی فرد باشد.
			</p>
			<span className="mt-1 fontSizeMiddle">
						۳- حداقل ۳۰۰ کاراکتر مطلوب در نقد کاربران باید وجود داشته باشد.
						<p>مواردی که شامل تعریف کاراکتر مطلوب نمی‌شوند:</p>
						<p>– قرار دادن فضای خالی (Space) بیش از حد معمول</p>
						<p>– کشیدن حروف یا کلمات با استفاده از صفحه کلید</p>
						<p>– استفاده ی مکرر از یک حرف یا کلمه</p>
						<p>– بیان مطلب تکراری با نگارش متفاوت</p>
						<p>لازم به ذکر است که رعایت استاندارد تعداد کاراکتر مطلوب برای نقد مناسب ضروری است، لذا کاربرانی که نمی‌توانند تعداد کاراکتر مطلوب نقدشان را به ۳۰۰ برسانند، باید در قسمت نظرات متن خود را ثبت کنند، در غیر اینصورت امکان تایید نقد کمتر از ۳۰۰ کاراکتر مطلوب در قسمت نقد کاربران وجود نخواهد داشت.</p>
					</span>
			<p className="mt-1 fontSizeMiddle">
				۴- برای ارسال نقد، لازم است کاربران تا حد ممکن از مبالغه و بزرگنمایی مزایا یا معایب محصول خودداری کنند. در غیر اینصورت نقد مورد نظر تایید نخواهد شد.
			</p>
			<p className="mt-1 fontSizeMiddle">
				۵- نقد مناسب، نقدی است که به طور واقع بینانه معایب و مزایای هر محصول را در کنار هم بررسی کند.
			</p>
			<p className="mt-1 fontSizeMiddle">
				۶- با توجه به تفاوت در سطح محصولات مختلف و تفاوت عمده در قیمت‌های آنها، لازم است نقد و بررسی هر محصول با توجه به قیمت آن صورت گیرد نه به صورت مطلق.
			</p>
			<p className="mt-1 fontSizeMiddle">
				۷- جهت احترام به وقت بازدیدکنندگان سایت و نقدها، لازم است نویسندگان نقد مطالب غیر ضروری را در نقدشان حذف کرده و تا حد ممکن تنها مطالب ضروری و مفید را در نقدشان لحاظ کنند.
			</p>
			<p className="mt-1 fontSizeMiddle">
				۸- با توجه به ساختار بخش نظرات، از پرسیدن سوال یا درخواست راهنمایی در این بخش جدا خودداری نمایید و پرسش و پاسخ های خود را در بخش مربوط به “پرسش و پاسخ های کاربران در مورد هر کلا” بیان کنید .
			</p>
			<p className="mt-1 fontSizeMiddle">
				۹- تنها نظراتی و یا پرسش و پاسخ هایی که با حروف و زبان فارسی نوشته شده باشند، امکان نمایش در سایت را دارند، لذا از نوشتن با حروف انگلیسی یا به زبان انگلیسی خودداری نمایید.
			</p>
			<p className="mt-1 fontSizeMiddle">
				۱۰- کاربران ارسال کننده نظر یا پرسش و پاسخ موظف به استفاده از ادبیات محترمانه و عدم توهین به دیگر کاربران هستند، بدیهی است هرگونه توهین به فرد یا افرادی، باعث عدم تایید نظر کاربر می‌شود.
			</p>
			<p className="mt-1 fontSizeMiddle">
				۱۱- قسمت نظرات یا پرسش و پاسخ های سایت، با تالارهای گفتگو (فروم) متفاوت است، لذا برای حفظ ساختار، مباحثی که خارج از چهارچوب این قسمت است و حالت بحث و گفتگو دارند، تایید نخواهند شد.
			</p>
			<p className="mt-1 fontSizeMiddle">
				۱۲- تمام کاربران حق دارند نظرات خود را به شرط رعایت قوانین، در سایت منتشر کنند، لذا حتی اگر نظری را به دور از واقعیت، جانبدارانه یا اشتباه یافتید، نباید نظر دهنده را مخاطب قرار دهید یا از وی انتقاد نمایید. هر کاربر تنها می‌تواند نظر خود را عنوان کند و قضاوت را به خوانندگان نظرات واگذار نماید.
			</p>
			<p className="mt-1 fontSizeMiddle">
				۱۳- از بزرگنمایی یا اغراق درباره نقاط قوت یا نقاط ضعف محصول در نظرات خود خودداری کنید. بدیهی است تا حد ممکن هرگونه نظر مبالغه آمیز یا به دور از واقعیت تایید نخواهد شد.
			</p>
			<p className="mt-1 fontSizeMiddle">
				۱۴- با توجه به مسئولیت سایت در قبال لینک‌های موجود در آن؛ کاربران نباید لینک سایت‌های دیگر را در نظرات خود ثبت نمایند. کاربران دقت داشته باشند تا در صورت درج لینک، لینک ها به صورت خودکار تبدیل به متن می شود. یا اگر لینک دارای مشکل قانونی یا مخرب باشد نظر یا لینک حذف خواهد شد.
			</p>
			<p className="mt-1 fontSizeMiddle">
				۱۵- تنها نظراتی که مرتبط با محصول مورد نظر باشند، تایید خواهند شد، لذا از مطرح کردن بحث‌های متفرقه و غیر مرتبط با محصول خودداری نمایید.
			</p>
			<p className="mt-1 fontSizeMiddle">
				۱۷- کاربران می‌توانند نقد خود به هر بخش ایزی سازه را در قسمت مربوطه اعلام نمایند، لذا از نوشتن نقد خود درباره سایت یا خدمات آن در قسمت نظرات خودداری نمایید.
			</p>
			<p className="mt-1 fontSizeMiddle">
				۱۸- کاربران توجه داشته باشند، مسائلی را که از آن اطمینان ندارند یا نسبت به آن شک دارند، به هیچ وجه در نظرات یا قسمت پرسش و پاسخ ثبت ننمایند. و همچنین از بازنشر شایعات یا اطلاعات غیر مطمئن درباره محصولات جدا خودداری نمایند.
			</p>
			<p className="mt-1 fontSizeMiddle">
				۱۹- ثبت اطلاعات ارتباطی شخصی، از جمله شماره تلفن یا آدرس ایمیل در قسمت نظرات ممنوع است، لذا از ثبت اینگونه اطلاعات ارتباطی در نظرات خود خودداری نمایید.
			</p>
			<p className="mt-1 fontSizeMiddle">
				۲۰- لازم است کاربران نظرات خود را به صورت نگارشی و نه گفتاری ثبت نمایند و از کوتاه کردن کلمات یا استفاده از ادبیات محاوره ای تا جای ممکن در ثبت نظرات خودداری نمایند. استفاده از ادبیات نوشتاری که قابلیت نمایش در سایت را داشته باشد، لازمه تایید نظرات کاربران است.
			</p>
			<p className="mt-1 fontSizeMiddle">
				۲۱- کاربران در نظر داشته باشند که ایزی سازه ، ویرایش نگارشی نظرات کاربران را حق خود می‌داند اما سایر ویرایش‌هایی که برای رعایت قوانین ذکر شده انجام می‌شود، قبل از ثبت نظر، به اجازه کاربر نیاز خواهد داشت.
				همچنین نظراتی که کاربران در خصوص کالا در وب¬‌سایت درج کرده‌اند، تجربه یا اطلاعات شخصی افراد است و برای آنها و ایزی سازه مسئولیتی ایجاد نمی‌کند.
			</p>
			<label className="mt-5 fontSizeMiddle font-weight-bold">محتوا، مطالب و توضیحات ارائه شده در سایت درباره محصول یا در وبلاگ</label>
			<p className="mt-1 fontSizeMiddle">
				ایزی سازه نهایت تلاش و دقت را در راستای ارائه تمامی سرویس‌‏های خود می‏‌کند و به منظور تولید محتوا از منابع و مراجع اصیل و نیز شرکت‏‌های سازنده محصولات استفاده می‏‌کند. لازم به ذکر است ایزی سازه تضمین نمی‏‌کند که مطالب مندرج در سایت عاری از خطا باشد. اگر مطلب ارائه شده توسط ایزی سازه دارای هر گونه مغایرت با اطلاعات درج شده در سایت است، لطفا به ما اطلاع دهید.
			</p>
			<p className="fontSizeMiddle">
				سایت ایزی سازه ممکن است دارای سرویس‌‏هایی با قابلیت مشارکت عمومی موسوم به سرویس‌‏های جمعی، همچون اتاق گفتگو، تابلوی اعلانات، تالار گفتگو، نقد، گروه‌‏های خبری، شبکه دوستان و سرویس‏‌های دیگری باشد که برای تسهیل ارتباط شما با دیگران (چه در مقیاس عمومی مثل تالار گفتگو و چه در مقیاس خصوصی مثل شبکه خصوصی دوستان) ارائه می‏‌شوند. شما توافق می‏‌کنید که از این سرویس‏‌های جمعی، فقط برای ثبت، ارسال و دریافت پیام‏‌هایی استفاده کنید که مناسب و مرتبط با آن سرویس خاص باشد.

			</p>
			<p className="fontSizeMiddle">
				سروﻳس‌‏های سایت آن‏گونه که هست ارائه می‏‌شود و سایت ایزی سازه تحت هیچ شرایطی مسوولیت تاخیر یا عدم کارکرد سایت را که می‌تواند ناشى از عوامل طبیعى، نیروى انسانی، مشکلات اینترنتى، خرابی تجهیزات کامپیوترى، مخابراتى و غیره باشد بر عهده ندارد.
			</p>
			<p className="fontSizeMiddle">
				وب ‏‌سایت ایزی سازه هیچ گونه مسوولیتی را در رابطه با حذف شدن صفحه‏‌های سایت خود و یا لینک‏‌های مرده نمی‌‏پذیرد.
			</p>
			<p className="fontSizeMiddle">
				© کلیه محتویات سایت ایزی سازه شامل قانون حق تکثیر شده و به سایت ایزی سازه تعلق دارد.
			</p>
			<label className="mt-5 fontSizeMiddle font-weight-bold">نمایندگی</label>
			<p className="mt-1 fontSizeMiddle">
				ایزی سازه در هیچ نقطه‏‌ای از کشور نمایندگی فروش و یا خدمات پس از فروش ندارد و کلیه سرویس‌‏ها، تراکنش‏‌های مالی و خدمات قابل ارائه از طریق دفتر مرکزی پردازش می‏‌شود. لطفاً در صورت مشاهده هر گونه تخلفی از این دست، مراتب را جهت پیگرد قانونی به ایزی سازه اطلاع دهید.
			</p>
			<p className="fontSizeMiddle">
				ایزی سازه خود را ملزم به رعایت حریم شخصی کاربران می‌داند، لطفا در صورت مشاهده هرگونه تخلف، مراتب را از طریق کانال‏‌های ارتباطی ذکر شده با ما در میان بگذارید.
			</p>
		</div>
	);
}

export default Terms;
